[
    {
        "id": 1,
        "autores": [ "Carlos Fernando Aguilar Ibáñez","Suárez Castañón Miguel Santiago"] ,
        "titulo": "An algebraic version of the active disturbance rejection control for second-order flat systems",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "International Journal of Control"  ,
        "resumen": "An algebra-based active disturbance rejection control approach for uncertain second-order flat systems, perturbed by a matching perturbation, is presented. This approach consists of proposing an online algebraic estimator for the uncertain system, together with an algebraic reconstructor for the unknown velocity. To assess the efficiency of the approach, numerical simulations to control an uncertain longitudinal vehicle system were carried out.",
        "observaciones": "DOI 10.1080/00207179.2019.1589651",
        "lugar": "Oxford",
        "pais": "Reino Unido",
        "noPaginas": "215-222",
        "volumen": "v. 94 no. 1",
        "inicio": "2021-01-05",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 2,
        "autores": [ "Rubio Ávila José de Jesús","Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Learning of operator hand movements via least angle regression to be teached in a manipulator",
        "tipo": "Revista",
        "subTipo": "SCOPUS",
        "descripcion": "Evolving Systems"  ,
        "resumen": "In this document, a control system is developed to allow a manipulator to learn and plan references from demonstrations given by an operator hand. Data entry is acquired by a sensor and is learned by the generalized learning model with least angle regression to create a desired reference in three dimensional space. A fifth reference profile is employed to smooth the desired reference. Direct and inverse kinematics are gotten to represent the transformation between the three dimensional space and each of the manipulator links. A dynamic model is gotten using Newton-Euler formulation. An evolving proportional derivative (PD) control is applied to get that the manipulator end effector follows the operator hand movements. The monitoring and control systems are implemented in an embedded platform for testing purposes.",
        "observaciones": "DOI 10.1007/s12530-018-9224-1",
        "lugar": "London",
        "pais": "Reino Unido",
        "noPaginas": "317-332",
        "volumen": "v. 11 no. 2",
        "inicio": "2020-06-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 3,
        "autores": [ "Juan Carlos Chimal Eguía","Castillo Montiel Erandi","Rangel Reyes Julio César"] ,
        "titulo": "Modeling dendritic cell pulsed immunotherapy for mice with melanoma-protocols for success and recurrence",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "applied sciences MDPI"  ,
        "resumen": "Nowadays, immunotherapy has become an important alternative to fight cancer. One way in which biologists and medics use immunotherapy is by injecting antigen-incubated Dendritic Cells (DCs) into mice to stimulate an immune response. The DCs optimal quantities and infusion times for a successful cancer eradication are often unknown to the therapists; usually, these quantities are obtained by testing various protocols. The article shows a model of five differential equations which represents some interactions between some cells of the immune system and tumor cells which is used to test different infusion protocols of Dendritic Cells. This study aims to find operation ranges to DCs quantities and injection times for which the therapy reduces the tumor significantly. To that end, an exhaustive search of operative protocols is performed using simulations of a mathematical model. Furthermore, nonlinear analysis of the model reveals that without the DC therapy tumor cells cannot stay under non-lethal bounds. Finally, we show that a pulsed periodic therapy can prevent tumor relapsing when the doses and period times lie within a certain range.",
        "observaciones": "https://doi.org/10.3390/app11073199",
        "lugar": "CDMX",
        "pais": "Mexico",
        "noPaginas": "17 PP",
        "volumen": "11",
        "inicio": "2021-02-12",
        "fin": "2021-04-02",
        "ISBN": ""
    },
    {
        "id": 4,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "On the Rejection of Random Perturbations and the Tracking of Random References in a Quadrotor",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Complexity"  ,
        "resumen": "In this note, the problem of tracking random references and rejecting random perturbations in a quadrotor, both generated by an auxiliary system named exosystem, is solved by extending the deterministic tracking problem to the area of stochastic processes. Besides, it is considered that only a part of the state vector of the quadrotor is available through measurements. As a consequence, the state vector of the plant must be estimated in order to close the control loop. On this basis, a controller to track random references and to reject random perturbations is developed by combining a Kalman filter to estimate the references and perturbations of an exosystem and an observer to estimate the states of a quadrotor. Besides, to obtain a more practical controller, the analysis is carried out in discrete time. Numerical simulations are used in a quadrotor to confirm the validity and effectiveness of the proposed control. © 2022 Jesus Alberto Meda-Campaña et al.",
        "observaciones": "DOI 10.1155/2022/3981340",
        "lugar": "London",
        "pais": "Reino Unido",
        "noPaginas": "Article number 3981340",
        "volumen": "v. 2022",
        "inicio": "2022-01-20",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 5,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Adaptive output-feedback trajectory tracking for a class of uncertain second-order linear systems",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "IMA Journal of Mathematical Control and Information"  ,
        "resumen": "In this work, we present a novel design of an explicit control strategy to solve the trajectory tracking problem for an uncertain second-order linear system with only partial availability of the state. The system parameters are unknown, and an additive constant disturbance is considered. Despite the apparent simplicity of this system, the solution requires an intricate combination of available methodologies. The proposed approach corresponds to a Lyapunov-based adaptive control strategy consisting of a reduced-order observer, a dynamic slave system and an adaptive controller with dynamic extension. Simulation results are provided to highlight the effectiveness of the proposed adaptive control strategy in accomplishing the regulation and trajectory tracking problems. © 2024 The Author(s). Published by Oxford University Press on behalf of the Institute of Mathematics and its Applications. All rights reserved.",
        "observaciones": "DOI 10.1093/imamci/dnae021",
        "lugar": "Oxford",
        "pais": "Reino Unido",
        "noPaginas": "495-505",
        "volumen": "v. 41 no. 3",
        "inicio": "2024-09-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 6,
        "autores": [ "Juan Carlos Chimal Eguía"] ,
        "titulo": "Optimization Criteria and Efficiency of a Thermoelectric Generator",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Entropy"  ,
        "resumen": "The efficiency of a thermoelectric generator model under maximum conditions is presented for two optimization criteria proposed under the context of finite-time thermodynamics, namely, the efficient power criterion and the Omega function, where this last function represents a trade-off between useful and lost energy. The results are compared with the performance of the device at maximum power output. A macroscopic thermoelectric generator (TEG) model with three possible sources of irreversibilities is considered: (Formula presented.) the electric resistance R for the Joule heating, (Formula presented.) the thermal conductances (Formula presented.) and (Formula presented.) of the heat exchangers between the thermal baths and the TEG, and (Formula presented.) the internal thermal conductance K for heat leakage. In particular, two configurations of the macroscopic TEG are studied: the so-called exoreversible case and the endoreversible limit. It shows that for both TEG configurations, the efficiency at maximum Omega function is always greater than that obtained in conditions of maximum efficient power, and this in turn is greater than that of the maximum power regime. © 2022 by the authors.",
        "observaciones": "DOI 10.3390/e24121812",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 1812",
        "volumen": "v. 24 no. 12",
        "inicio": "2022-12-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 7,
        "autores": [ "Cardona López Manuel Alejandro","Juan Carlos Chimal Eguía"] ,
        "titulo": "Statistical Analysis of the Negative-Positive Transformation in Image Encryption",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Mathematics"  ,
        "resumen": "The negative-positive transformation (NPT) is a widely employed technique for encrypting images on pixel blocks, commonly integrated into cryptosystems compatible with compression algorithms. The existing literature on NPT analysis can be categorized into two types: theoretical analyses with results that apply to any image, primarily focused on compression compatibility, and numerical analyses that report empirical results from specific images, some without explaining the causes of the security results, while others are only related to the compression performance. Consequently, there is a significant gap in understanding the implications of applying the NPT for data protection. For that reason, this paper conducts a theoretical statistical analysis, presenting, demonstrating, and verifying six theorems to understand the security contributions of NPT. Two theorems examine the shape of the image histogram and the scatter plot of adjacent pixels after the NPT application. The subsequent four theorems explore the influence of NPT on the mean, variance, covariance, and correlation within each pixel block. The findings indicate that the NPT generates images with symmetrical histograms, the correlation of pixel blocks remains invariant, and distinct vertical and horizontal reflections manifest on the scatter plot. These theorems are verified by encrypting the Lena image with four pixel-block sizes. The histogram symmetry passed the goodness-of-fit test at a significance level of 5%, revealing consistent results. The correlation of pixel blocks remained unchanged, and the scatter plot exhibited an x-shaped pattern. Therefore, as the NPT alone does not achieve desirable encryption results, such as uniform histograms, scatter plots, and decreasing correlation, cryptosystems should complement it with additional techniques. © 2024 by the authors.",
        "observaciones": "DOI 10.3390/math12060908",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 908",
        "volumen": "v. 12 no. 6",
        "inicio": "2024-03-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 8,
        "autores": [ "García Juanillo Donaldo","Sossa Azuela Juan Humberto","Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Electricity consumption modeling by a chaotic convolutional radial basis function network",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Journal of Supercomputing",
        "resumen": "Electricity is an essential energy resource in the industrial, commercial and housing sector, having a very important role in the development of societies. Urbanization and industrialization implies a great demand of energy for developing economies. In the search to be able to know how much electrical energy is consumed, a modeling of the electrical energy demand is carried out. However, the inherent intricacy and nonlinear nature of electricity consumption patterns present a significant obstacle to achieve precise modeling. In this article, a chaos theory approach is carried out to analyze the behavior of the system and to obtain properties of its dynamic system. A network consisting of a convolutional part, a hidden part and an output part is proposed. Convolutional operations are employed for dimensionality reduction in transformed data sets by reconstruction of the phase space. A radial basis function neural is used in the hidden part. The dynamic analysis approach using chaos theory, and the proposed neural network is compared with the radial basis function neural network for the modeling of electrical energy consumption. © The Author(s), under exclusive licence to Springer Science+Business Media, LLC, part of Springer Nature 2023.",
        "observaciones": "DOI 10.1007/s11227-023-05733-y",
        "lugar": "Dordrecht",
        "pais": "Paises Bajos",
        "noPaginas": "7102-7119",
        "volumen": "v. 80 no. 5",
        "inicio": "2024-03-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 9,
        "autores": [ "Carlos Fernando Aguilar Ibáñez","Suárez Castañón Miguel Santiago","Barrón Fernández Ricardo"] ,
        "titulo": "Trajectory Tracking Control of an Autonomous Vessel in the Presence of Unknown Dynamics and Disturbances",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Mathematics"  ,
        "resumen": "We present a proportional-integral-derivative-based controller plus an adaptive slide surface to solve the trajectory tracking control problem for a fully actuated vessel with unknown parameters perturbed by slowly varying external unknown dynamics. The controller design assumes that the vessel moves at low speed and frequency, its physical parameters are unknown, and its state is measurable. The control approach ensures error tracking convergence toward a small vicinity at the origin. We conduct the corresponding stability analysis using the Lyapunov theory and saturation functions. We tested the controller through two numerical experiments—a turning ellipse maneuver and a rest-to-rest maneuver—where the vessel parameters were unknown, and we obtained satisfactory results. © 2024 by the authors.",
        "observaciones": "DOI 10.3390/math12142239",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 2239",
        "volumen": "v. 12 no. 4",
        "inicio": "2024-07-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 10,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Parametric uncertain second-order linear system output-adaptive stabilization: An integral and MRCA based approach",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "European Journal of Control"  ,
        "resumen": "This work proposes a solution for the adaptive stabilization of second-order linear systems with unknown parameters using only position measurements. Only the sign of the control law is known and the system is affected by constant perturbations. The crux of the proposed control scheme the use of an alternative representation of the system obtained through integrating over time the original system representation. In this way, the whole state of the alternative representation is available from measurements, and an extended state space representation is obtained through the alternative representation and the differential equation related to the integral over time of the original input. Later, an Adaptive Control methodology and an backstepping procedure are used to establish closed-loop stability. Simulation results support the findings.",
        "observaciones": "DOI 10.1016/j.ejcon.2020.04.002",
        "lugar": "Amsterdam",
        "pais": "Paises Bajos",
        "noPaginas": "76-81",
        "volumen": "v. 57",
        "inicio": "2021-01-19",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 11,
        "autores": [ "Juan Carlos Chimal Eguía","Rangel Reyes Julio César"] ,
        "titulo": "Improving convergence in therapy scheduling optimization: A simulation study",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Mathematics"  ,
        "resumen": "The infusion times and drug quantities are two primary variables to optimize when designing a therapeutic schedule. In this work, we test and analyze several extensions to the gradient descent equations in an optimal control algorithm conceived for therapy scheduling optimization. The goal is to provide insights into the best strategies to follow in terms of convergence speed when implementing our method in models for dendritic cell immunotherapy. The method gives a pulsed-like control that models a series of bolus injections and aims to minimize a cost a function, which minimizes tumor size and to keep the tumor under a threshold. Additionally, we introduce a stochastic iteration step in the algorithm, which serves to reduce the number of gradient computations, similar to a stochastic gradient descent scheme in machine learning. Finally, we employ the algorithm to two therapy schedule optimization problems in dendritic cell immunotherapy and contrast our method's stochastic and non-stochastic optimizations. © 2020 by the authors. Licensee MDPI, Basel, Switzerland.",
        "observaciones": "DOI 10.3390/math8122114",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "1-17",
        "volumen": "v. 8 no. 12",
        "inicio": "2020-12-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 12,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Robust Velocity and Load Observer for a General Noisy Rotating Machine",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Machines"  ,
        "resumen": "This paper is focused on the design of a nonlinear observer for a rotatory machine with noise-affected output. It is assumed that the system is subject to bounded perturbations, and the original linear model of the machine is reformulated as a nonlinear system to include the desired signals to be estimated, namely, the velocity and load torque. The proposed observer leverages the so-called algebraic state-dependent Riccati equation to provide a robust estimation. Lyapunov analysis guarantees the convergence of the estimation error to a “ (Formula presented.) zone”. The proposed observer's effectiveness is assessed through convincing numerical simulations and real-time experiments. © 2022 by the authors.",
        "observaciones": "DOI 10.3390/machines10111009",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 1009",
        "volumen": "v. 10 no.11",
        "inicio": "2022-11-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 13,
        "autores": [ "Mendoza Mendoza Julio Alberto","Carlos Fernando Aguilar Ibáñez","Suárez Castañón Miguel Santiago"] ,
        "titulo": "Snake Aerial Manipulators: A Review",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "IEEE Access"  ,
        "resumen": "In this document, a review about snake aerial manipulators is presented. The most common mechatronical implications found in their design are described. The text is presented to the reader as a set of modules, this include topics about structural dynamics, aerodynamics, power and energy, propulsion, thrust-vectoring and level of autonomy of aircrafts, also highlights about use of sensors, control methods and flight schemes.",
        "observaciones": "DOI 10.1109/ACCESS.2020.2971247",
        "lugar": "New Jersey",
        "pais": "Estados Unidos",
        "noPaginas": "28222-28241",
        "volumen": "v. 8",
        "inicio": "2020-02-14",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 14,
        "autores": [ "Juan Carlos Chimal Eguía","Castillo Montiel Erandi"] ,
        "titulo": "Properties of the Vascular Networks in Malignant Tumors",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Entropy"  ,
        "resumen": "This work presents an analysis for real and synthetic angiogenic networks using a tomography image that obtains a portrait of a vascular network. After the image conversion into a binary format it is possible to measure various network properties, which includes the average path length, the clustering coefficient, the degree distribution and the fractal dimension. When comparing the observed properties with that produced by the Invasion Percolation algorithm (IPA), we observe that there exist differences between the properties obtained by the real and the synthetic networks produced by the IPA algorithm. Taking into account the former, a new algorithm which models the expansion of an angiogenic network through randomly heuristic rules is proposed. When comparing this new algorithm with the real networks it is observed that now both share some properties. Once creating synthetic networks, we prove the robustness of the network by subjecting the original angiogenic and the synthetic networks to the removal of the most connected nodes, and see to what extent the properties changed. Using this concept of robustness, in a very naive fashion it is possible to launch a hypothetical proposal for a therapeutic treatment based on the robustness of the network.",
        "observaciones": "DOI 10.3390/e22020166",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 166",
        "volumen": "v. 22 no. 2",
        "inicio": "2020-02-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 15,
        "autores": [ "Juan Carlos Chimal Eguía","Castillo Montiel Erandi","Rangel Reyes Julio César"] ,
        "titulo": "Modeling dendritic cell pulsed immunotherapy for mice with melanoma-protocols for success and recurrence Descripción applied sciences",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Applied Sciences (Switzerland)"  ,
        "resumen": "Nowadays, immunotherapy has become an important alternative to fight cancer. One way in which biologists and medics use immunotherapy is by injecting antigen-incubated Dendritic Cells (DCs) into mice to stimulate an immune response. The DCs optimal quantities and infusion times for a successful cancer eradication are often unknown to the therapists; usually, these quantities are obtained by testing various protocols. The article shows a model of five differential equations which represents some interactions between some cells of the immune system and tumor cells which is used to test different infusion protocols of Dendritic Cells. This study aims to find operation ranges to DCs quantities and injection times for which the therapy reduces the tumor significantly. To that end, an exhaustive search of operative protocols is performed using simulations of a mathematical model. Furthermore, nonlinear analysis of the model reveals that without the DC therapy tumor cells cannot stay under non-lethal bounds. Finally, we show that a pulsed periodic therapy can prevent tumor relapsing when the doses and period times lie within a certain range. © 2021 by the authors.",
        "observaciones": "DOI 10.3390/app11073199",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 3199",
        "volumen": "v. 11 no. 7",
        "inicio": "2021-04-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 16,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "On the Output-Feedback Regulation for a Second-Order System with Unknown Parameters: An I&I and MRAC Based Approach",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Acta Applicandae Mathematicae"  ,
        "resumen": "We propose an adaptive stabilization solution for a linear second-order system with unknown parameters, where only the position and the sign of the constant associated with the control input are known. The control strategy consists in proposing a filter system with its whole state available and having the same structure as the uncertain system. Then, based on the Immersion & Invariance approach, and the Model Reference method, we design an adaptive controller to stabilize the filter system. Finally, using the backstepping approach, we stabilize the original uncertain system. We carry out the convergence analysis using the traditional Lyapunov method, in conjunction with the Barbalat’s Lemma. The obtained control strategy is simple and easy to implement. We assess the effectiveness of our adaptive control strategy through numerical simulations. © 2021, The Author(s), under exclusive licence to Springer Nature B.V.",
        "observaciones": "DOI 10.1007/s10440-021-00460-z",
        "lugar": "Dordrecht",
        "pais": "Paises Bajos",
        "noPaginas": "Article number 17",
        "volumen": "v. 176 no. 1",
        "inicio": "2021-12-15",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 17,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Robust regulation of a PVTOL aircraft subject to crosswind disturbances: Passivity and integral sliding mode approach",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "PLoS ONE"  ,
        "resumen": "This paper deals with the problem of robust regulation of a Planar Vertical Takeoff and Landing (PVTOL) aircraft affected by crosswind disturbances. The proposed approach simultaneously exploits the advantages of passivity-based control and the integral sliding mode (ISM) control technique. We demonstrate that the passivity-based controller accomplishes the PVTOL regulation within a guaranteed stability region. At the same time, the ISM controller can effectively counteract the undesirable disturbances effect from the beginning of the operation since the disturbances are never seen in the measurable output. Using the passivity approach with LaSalle’s Invariance Theorem, we construct the required Lyapunov function to establish the closed-loop system stability. The proposed combination of controllers results in a robust system that satisfactorily solves the regulation problem. Numerical simulations are provided to show that the proposed approach allows the tracking of different reference signals: pulse-train shaped trajectory and ellipse-shaped trajectory, considering the presence of perturbations (crosswind). Furthermore, to illustrate the effectiveness of the proposed technique, a comparative analysis considering two robust control strategies is provided. Copyright: © 2024 Aguilar-Ibanez et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.",
        "observaciones": "DOI 10.1371/journal.pone.0307398",
        "lugar": "San Francisco, California",
        "pais": "Estados Unidos",
        "noPaginas": "Article number e0307398",
        "volumen": "v. 19 no. 12",
        "inicio": "2024-12-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 18,
        "autores": [ "Hernández Oregón Gerardo","Rivero Ángeles Mario Eduardo","Juan Carlos Chimal Eguía","Coyac Torres Jorge Enrique"] ,
        "titulo": "Performance Analysis of P2P Networks with Light Communication Links: The Static Managed Case",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Applied Sciences (Switzerland)"  ,
        "resumen": "Peer-to-Peer (P2P) networks have emerged as potential solutions to issues that cause inefficient download times in networks because they can use the resources in the entire network, allowing nodes to act both as servers and clients simultaneously. Commonly, P2P networks use radio frequency (RF) to communicate among nodes; however, light fidelity (LiFi) has been developed as an alternative to wireless fidelity (WiFi) systems due to some advantages such as great speed (up to 1 Tbps), a high level of security, and less saturated channels in unlicensed bandwidth, making it ideal for RF-sensitive environments and networks with static nodes, since LiFi systems require a high node alignment level to enable efficient communication. In this article, we develop a mathematical model that captures the dynamics of LiFi- and WiFi-based P2P networks in static environments to allow for adequate LiFi links in managed conditions where the content is distributed from a single source node to the rest of the peers through different architectures. For the services considered in our work, we compare the performance of P2P networks using WiFi 7 and LiFi 2.0 technologies to provide clear quantitative numerical results that allow for adequate selection between these systems. Also, we validate our mathematical results through extensive simulations. © 2023 by the authors.",
        "observaciones": "DOI 10.3390/app13137906",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 7906",
        "volumen": "v. 13 no. 13",
        "inicio": "2023-07-26",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 19,
        "autores": [ "García Juanillo Donaldo","Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Optimized radial basis function network for the fatigue driving modeling",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Journal of Supercomputing"  ,
        "resumen": "The optimized radial basis function network is a kind of neural network that utilizes a step size inside of the gradient strategy for the modeling, where a small step size will spend much time to reach a minimum, while a big step size will jump over the minimum; hence, it needs an acceptable step size. The genetic optimizer is one option to seek an acceptable step size. In this study, the genetic optimizer is suggested to seek an acceptable step size in the gradient strategy for an optimized radial basis function network. The difference between the other genetic optimizers and our genetic optimizer is that the other genetic optimizers utilize high number of stages, while our genetic optimizer utilizes small number of stages. The idea of utilizing small number of stages in our genetic optimizer is based on the simplex optimizer and bat optimizer which also utilize small number of stages. To validate the performance of the optimized radial basis function network, the fatigue driving modeling in a vehicle is evaluated. © The Author(s), under exclusive licence to Springer Science+Business Media, LLC, part of Springer Nature 2023.",
        "observaciones": "DOI 10.1007/s11227-023-05775-2",
        "lugar": "Dordrecht",
        "pais": "Paises Bajos",
        "noPaginas": "8719-8741",
        "volumen": "v. 80 no. 7",
        "inicio": "2024-05-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 20,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Controlling the PVTOL Aircraft System with an Inverted Pendular Load by means of Nested Saturation Functions and GPI Controller",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Mathematical Problems in Engineering"  ,
        "resumen": "This paper presents a control scheme that allows height position regulation and stabilization for an unmanned planar vertical takeoff and landing aircraft system with an inverted pendular load. The proposed controller consists of nested saturations and a generalized proportional integral (GPI). The GPI controls the aircraft height and the roll attitude; the latter is used as the fictitious input control. Next, the system is reduced through linear transformations, expressing it as an integrator chain with a nonlinear perturbation. Finally, the nested saturation function-based controller stabilizes the aircraft's horizontal position and the pendulum's angle. Obtaining the control approach was a challenging task due to the underactuated nature of the aircraft, particularly ensuring the pendulum's upright position. The stability analysis was based on the second method of Lyapunov using a simple candidate function. The numerical simulation confirmed the control strategy's effectiveness and performance. Additionally, the numerical simulation included a comparison against a PD controller, where its corresponding performance indexes were estimated, revealing that our controller had a better response in the presence of unknown disturbances. © 2021 Cesar Alejandro Villaseñor Rios et al.",
        "observaciones": "DOI 10.1155/2021/2295417",
        "lugar": "London",
        "pais": "Reino Unido",
        "noPaginas": "Article number 2295417",
        "volumen": "2021",
        "inicio": "2021-11-19",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 21,
        "autores": [ "Juan Carlos Chimal Eguía"] ,
        "titulo": "Global Stability of the Curzon-Ahlborn Engine with a Working Substance That Satisfies the van der Waals Equation of State",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Entropy"  ,
        "resumen": "In this paper, we show an analysis of the global stability of a Curzon-Ahlborn engine considering that the working substance of the engine satisfies the Van der Waals equation of state, which is more general than the ideal gas case. We use the Lyapunov stability theory for the case where the engine operates at a maximum power output. We analyze the steady state of the intermediate temperatures as well as the asymptotic behavior of the performance of the engine. Additionally, we study the relationship between the inherent time delay by analyzing the dynamic properties of the system and the stability of the steady state. We present illustrative graphs of the obtained results. Finally, we include a brief discussion of the obtained results and appropriate conclusions.",
        "observaciones": "DOI 10.3390/e24111655",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 1655",
        "volumen": "v. 24 no. 11",
        "inicio": "2022-11-14",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 22,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "An Integral and MRAC-Based Approach to the Adaptive Stabilisation of a Class of Linear Time-Delay Systems with Unknown Parameters",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "International Journal of Applied Mathematics and Computer Science"  ,
        "resumen": "The design of a novel strategy based on the model reference adaptive control method for the stabilisation of a second-order linear time-delay system with unknown parameters is presented. The proposed approach is developed under the assumption that only one state of the system is available, and the sign of the control gain is known. First, the integral operator is applied to obtain a new representation of the original system, where the whole state is known. The use of the integral operator decomposes the control problem into two subproblems that are solved by using the model reference adaptive control method and the backstepping procedure. The effectiveness of the proposed approach is illustrated through an academic example and a practical application case regarding a chemical reactor recycle system. © 2024 L.F. Ramírez Jerónimo et al.",
        "observaciones": "DOI 10.61822/amcs-2024-0006",
        "lugar": "Varsovia",
        "pais": "Polonia",
        "noPaginas": "81-91",
        "volumen": "v. 34 no. 1",
        "inicio": "2024-03-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 23,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Lyapunov-based estimation and control of velocity and load in rotating machines via Luenberger globally-convergent observer",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "European Journal of Control"  ,
        "resumen": "This paper presents the design of a Lyapunov-based Luenberger-like observer to simultaneously estimate the non-available angular velocity and the unknown constant load torque of rotating machines. This proposal assumes that the only measurable output is the rotor angle, which is considered to be defined in the circle, its natural topology. This provides nonlinear dynamics where the Lyapunov-based Luenberger-like observer globally converges. Moreover, a trajectory tracking controller for the motor angular velocity is also designed by feeding back the observer estimations. Convergence analysis of the observer-controller system is performed using Lyapunov-like theory. The effectiveness and performance of the system are validated through tests performed on an experimental platform. © 2024 European Control Association",
        "observaciones": "DOI 10.1016/j.ejcon.2024.101092",
        "lugar": "Amsterdam",
        "pais": "Paises Bajos",
        "noPaginas": "Article number 101092",
        "volumen": "v. 79",
        "inicio": "2024-09-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 24,
        "autores": [ "Rubio Ávila José de Jesús","Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "General controllability and observability tests for Takagi-Sugeno fuzzy systems",
        "tipo": "Revista",
        "subTipo": "SCOPUS",
        "descripcion": "Evolving Systems"  ,
        "resumen": "An approach for investigating controllability and observability properties in Takagi-Sugeno (TS) fuzzy systems is given. The proposed method is independent of the number of fuzzy rules acting at the same instant and independent of the number of inputs and outputs included in the TS fuzzy model. Therefore, it can be applied to a wide class of fuzzy systems. The analysis relies on the solution of a set of symbolic simultaneous equations with the fuzzy weights as the unknowns of such equations.",
        "observaciones": "DOI 10.1007/s12530-019-09281-w",
        "lugar": "London",
        "pais": "Reino Unido",
        "noPaginas": "349-358",
        "volumen": "v. 11 no. 2",
        "inicio": "2020-06-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 25,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "A Fuzzy Logic Model for Hourly Electrical Power Demand Modeling",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Electronics (Switzerland)"  ,
        "resumen": "In this article, a fuzzy logic model is proposed for more precise hourly electrical power demand modeling in New England. The issue that exists when considering hourly electrical power demand modeling is that these types of plants have a large amount of data. In order to obtain a more precise model of plants with a large amount of data, the main characteristics of the proposed fuzzy logic model are as follows: (1) it is in accordance with the conditions under which a fuzzy logic model and a radial basis mapping model are equivalent to obtain a new scheme, (2) it uses a combination of the descending gradient and the mini-lots approach to avoid applying the descending gradient to all data.",
        "observaciones": "DOI 10.3390/electronics10040448",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "1-12",
        "volumen": "v. 10 no. 4",
        "inicio": "2021-02-02",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 26,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Sliding Surface-Based Path Planning for Unmanned Aerial Vehicle Aerobatics",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Mathematics"  ,
        "resumen": "This paper exploits the concept of nonlinear sliding surfaces to be used as a basis in the development of aerial path planning projects involving aerobatic three-dimensional path curves in the presence of disturbances. This approach can be used for any kind of unmanned aerial vehicle aimed at performing aerobatic maneuvers. Each maneuver is associated with a nonlinear surface on which an aerial vehicle could be driven to slide. The surface design exploits the properties of Viviani’s curve and the Hopf bifurcation. A vector form of the super twisting algorithm steers the vehicle to the prescribed surfaces. A suitable switching control law is proposed to shift between surfaces at different time instants. A practical stability analysis that involves the descriptor approach allows for determining the controller gains. Numerical simulations are developed to illustrate the accomplishment of the suggested aerobatic flight. © 2024 by the authors.",
        "observaciones": "DOI 10.3390/math12071047",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 1047",
        "volumen": "v. 12 no. 7",
        "inicio": "2024-04-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 27,
        "autores": [ "Rubio Ávila José de Jesús","Carlos Fernando Aguilar Ibáñez","Novoa Colín Juan Francisco"] ,
        "titulo": "Stabilization of Robots With a Regulator Containing the Sigmoid Mapping",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "IEEE Access"  ,
        "resumen": "Actuators nonlinearities are unknown external perturbations in robots, which are unwanted because they can severely limit their performance. This research is focused on the stabilization of robots subject to actuators nonlinearities with a regulator containing the sigmoid mapping. Our regulator has the following three main characteristics: a) a sigmoid mapping is used to ensure boundedness of the regulator law terms, b) the chattering is reduced by the usage of the saturation mapping instead of the signum mapping, and c) the stabilization is ensured by the Lyapunov analysis. Finally, we evaluate our regulator for the stabilization of two robots.",
        "observaciones": "DOI 10.1109/ACCESS.2020.2994004",
        "lugar": "New Jersey",
        "pais": "Estados Unidos",
        "noPaginas": "89479-89488",
        "volumen": "v. 8",
        "inicio": "2020-05-22",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 28,
        "autores": [ "Silva García Victor Manuel","Flores Carapia Rolando","Rentería Márquez Carlos","Luna Benoso Benjamín","Juan Carlos Chimal Eguía"] ,
        "titulo": "Image Cipher Applications using the Elliptical Curve and Chaoc",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "International Journal of Applied Mathematics and Computer Science"  ,
        "resumen": "A novel symmetric cryptosystem of the substitution permutation network type is presented for image encryption in 14 rounds. An algorithm is developed to generate 15 keys to encrypt images where each key is the image size. These keys are calculated using an elliptic curve with a constant zero value. The proposed curve is non-singular, non-supersingular, nor trace one. Chaos is employed to find a generating element in a cyclic subgroup and it is produced using the logistic map equation. In addition, a 16 x 16 substitution box is constructed using both chaos and an algorithm that defines a bijective function. The following tools are used in order to measure the degree of randomness of the encrypted figures: entropy, correlation, the discrete Fourier transform and a goodness-of-fit test with the chi-square distribution. Furthermore, an image size variable permutation is applied in the first round, and its inverse in the fourteenth.",
        "observaciones": "DOI 10.34768/amcs-2020-0029",
        "lugar": "Zielona Gora",
        "pais": "Polonia",
        "noPaginas": "377-391",
        "volumen": "v. 30 no. 2",
        "inicio": "2020-06-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 29,
        "autores": [ "Rubio Ávila José de Jesús","Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Transformed structural properties method to determine the controllability and observability of robots",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Applied Sciences (Switzerland)"  ,
        "resumen": "Many investigations use a linearization method, and others use a structural properties method to determine the controllability and observability of robots. In this study, we propose a transformed structural properties method to determine the controllability and observability of robots, which is the combination of the linearization and the structural properties methods. The proposed method uses a transformation in the robot model to obtain a linear robot model with the gravity terms and uses the linearization of the gravity terms to obtain the linear robot model; this linear robot model is used to determine controllability and observability. The described combination evades the structural conditions requirement and decreases the approximation error. The proposed method is better than previous methods because the proposed method can obtain more precise controllability and observability results. The modified structural properties method is compared with the linearization method to determine the controllability and observability of three robots. © 2021 by the authors.",
        "observaciones": "DOI 10.3390/app11073082",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 3082",
        "volumen": "v. 11 no. 7",
        "inicio": "2021-04-01",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 30,
        "autores": [ "Corona Bermúdez Erendira","Juan Carlos Chimal Eguía","Germán Téllez Castillo"] ,
        "titulo": "Cryptographic Services Based on Elementary and Chaotic Cellular Automata",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Electronics (Switzerland)"  ,
        "resumen": "In this paper, a security framework based on cellular automata is proposed, which is composed of three parts: entity authentication, data encryption, and decryption. Authentication is based on a zero-knowledge protocol, and its robustness is supported by the fact that the shared secret is not only an NP-complete problem but also dynamically transformed by a two-dimensional cellular automaton into a more complex secret. Thus, the authentication’s output is the key to data encryption/decryption in the following steps. One more strength of this system is the sensibility of the cellular automata to initial conditions—which is why we must know the initial configuration in order to obtain the key and the times that cellular automata evolved. All those characteristics give the system both robustness and security. © 2022 by the authors. Licensee MDPI, Basel, Switzerland.",
        "observaciones": "DOI 10.3390/electronics11040613",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 613",
        "volumen": "v. 11 no. 4",
        "inicio": "2022-02-02",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 31,
        "autores": [ "Juan Carlos Chimal Eguía"] ,
        "titulo": "Mathematical model of antiviral immune response against the covid-19 virus",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Mathematics"  ,
        "resumen": "This work presents a mathematical model to investigate the current outbreak of the coronavirus disease 2019 (COVID-19) worldwide. The model presents the infection dynamics and emphasizes the role of the immune system: both the humoral response as well as the adaptive immune response. We built a mathematical model of delay differential equations describing a simplified view of the mechanism between the COVID-19 virus infection and the immune system. We conduct an analysis of the model exploring different scenarios, and our numerical results indicate that some theoretical immunotherapies are successful in eradicating the COVID-19 virus. © 2021 by the author. Licensee MDPI, Basel, Switzerland.",
        "observaciones": "DOI 10.3390/math9121356",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 1356",
        "volumen": "v. 9 no. 12",
        "inicio": "2021-06-02",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 32,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "The Regulation of an Electric Oven and an Inverted Pendulum",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Symmetry"  ,
        "resumen": "In this research, a proportional integral derivative regulator, a first-order sliding-mode regulator, and a second-order sliding-mode regulator are compared, for the regulation of two different types of mathematical model. A first-order sliding-mode regulator is a method where a sign-mapping checks that the error decays to zero after a convergence time; it has the problem of chattering in the output. A second-order sliding-mode regulator is a smooth method to counteract the chattering effect where the integral of the sign-mapping is used. A second-order sliding-mode regulator is presented as a new class of algorithm where the trajectory is asymptotic and stable; it is shown to greatly improve the convergence time in comparison with other regulators considered. Simulation and experimental results are described in which an electric oven is considered as a stable linear mathematical model, and an inverted pendulum is considered as an asymmetrical unstable non-linear mathematical model. © 2022 by the authors. Licensee MDPI, Basel, Switzerland.",
        "observaciones": "DOI 10.3390/sym14040759",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 759",
        "volumen": "v. 14 no. 4",
        "inicio": "2022-04-06",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 33,
        "autores": [ "Juan Carlos Chimal Eguía"] ,
        "titulo": "A simplified analysis of the Feynman pallet and ratchet mechanism considering different forms of generated power",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Journal of Non-Equilibrium Thermodynamics"  ,
        "resumen": "In this paper, we analyze the advanced Feynman's mechanism from the well-known Feynman's Lectures on Physics, under the maximum power output, maximum efficient power, and maximum power density criterion. Considering this mechanism like a thermal engine, and using a simplified model, the physical existence regions for these objective functions are shown. We also show their comparison for given values of a defined dimensionless parameter. The behavior for each case of both the general and the normalized forms of the objective functions is compared graphically and the existence of certain intervals of values for the variable parameter used, in which the relation of these objective functions change, is determined. Additionally, it is shown that as the numerical value of the mentioned variable parameter used approaches zero, the area of the region of physical existence of the objective functions is greater. The results of the mentioned comparison are discussed, and appropriate conclusions are included. © 2023 Walter de Gruyter GmbH, Berlin/Boston.",
        "observaciones": "DOI 10.1515/jnet-2022-0098",
        "lugar": "Berlin",
        "pais": "Alemania",
        "noPaginas": "291-302",
        "volumen": "v. 48 n. 3",
        "inicio": "2023-07-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 34,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "References tracking and perturbations reconstruction in a Cartesian robot",
        "tipo": "Revista",
        "subTipo": "CONACYT",
        "descripcion": "International Journal of Intelligent Robotics and Applications"  ,
        "resumen": "An exosystem needs to be nonlinear when it generates the perturbations to be reconstructed; however, an exosystem does not need to be nonlinear when it generates the references to be tracked. Resulting that the tracking of the references generated by an exosystem is an easier task. Hence, some studies on the references tracking should be made. Furthermore, to solve the references tracking, the perturbations are needed. In this research, the references tracking and the perturbations reconstruction in a Cartesian robot are discussed. For the perturbations reconstruction, an estimator is defined to force the reconstructed perturbations to track the perturbations of a Cartesian robot model. For the references tracking, a controller is defined to force a Cartesian robot model to track an exosystem. A theorem is addressed to prove the perturbations reconstruction. A theorem is addressed to prove the references tracking. A simulation in a Cartesian robot is used to confirm the validity and effectiveness of our controller with estimator in comparison with a feedback controller. © The Author(s), under exclusive licence to Springer Nature Singapore Pte Ltd. 2024.",
        "observaciones": "DOI 10.1007/s41315-023-00315-w",
        "lugar": "Singapore",
        "pais": "Singapur",
        "noPaginas": "357-369",
        "volumen": "v. 8 no. 2",
        "inicio": "2024-06-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 35,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Sound model of an orchestral kettledrum considering viscoelastic effects",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Applied Acoustics"  ,
        "resumen": "The modeling of the mechanical systems that describe musical instruments has long been a topic of interest for acoustic physicists. The orchestral kettledrum, distinguished by a broad spectrum of sounds, has been the subject of multiple investigations related to the goal of generating a realistic digital sound synthesis. In the present work, we apply the Green function method to estimate modal frequencies considering an air-loaded viscoelastic membrane. We propose a method that includes viscoelasticity to accurately predict the sound spectrum of the modeled kettledrum. Results are compared to real sound recordings of an orchestral kettledrum obtained in controlled conditions. The calculated modal frequencies are found to coincide well with the real values with an absolute mean error of 1.25±0.76 Hz and 1.87±1.83 Hz for the A2 and B2 ♭ tuned drumheads respectively. The spectral envelope of the synthesized sound spectrum coincides well with the Fourier transform of the real sound. The viscoelastic term was found to generally reduce the amplitude of the sound spectrum and in certain cases, better approximate the modal frequencies and decay times. The modal synthesis method used here is numerically lightweight and can be adapted to be used in real-time applications with low computational resources. To reproduce our experiment, the recorded kettledrum sounds and Python source code of the model are freely available.",
        "observaciones": "DOI 10.1016/j.apacoust.2020.107284",
        "lugar": "Oxford",
        "pais": "Reino Unido",
        "noPaginas": "Article number UNSP 107284 ",
        "volumen": "v. 164",
        "inicio": "2020-07-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 36,
        "autores": [ "Hernández García Rogelio Gerardo","Sossa Azuela Juan Humberto","Germán Téllez Castillo","Furlán Colín Federico"] ,
        "titulo": "Hybrid neural networks for big data classification",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Neurocomputing"  ,
        "resumen": "Two new hybrid neural architectures combining morphological neurons and perceptrons are introduced in this paper. The first architecture, called Morphological - Linear Neural Network (MLNN) consists of a hidden layer of morphological neurons and an output layer of classical perceptrons has the capability of extracting features. The second architecture, called Linear-Morphological Neural Network (LMNN) is composed of one or several perceptron layers as a feature extractor, it is then followed by an output layer of morphological neurons for non-linear classification. Both architectures are trained by stochastic gradient descent. One of the main contributions of this paper is to show that the morphological layer offers a greater capacity to extract features than the perceptron layer. This claim is supported both theoretically and experimentally. We prove that the morphological layer possesses a greater capacity per computation unit to segment the 2D input space than the perceptron layer. In other words, adding more hyper-boxes produces more response regions than adding hyperplanes. From an empirical point of view, we test the two new models on 25 standard datasets at low dimensionality and one big data dataset. The result is that MLNN requires a lesser number of learning parameters than the other tested architectures while achieving better accuracies.",
        "observaciones": "DOI 10.1016/j.neucom.2019.08.095",
        "lugar": "Amsterdam",
        "pais": "Paises Bajos",
        "noPaginas": "327-340",
        "volumen": "v. 390",
        "inicio": "2020-05-21",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 37,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "A Robust Control Scheme for a PVTOL System Subject to Wind Disturbances" ,
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Complexity"  ,
        "resumen": "In this study, a control scheme that allows performing height position regulation and stabilization for an unmanned planar vertical take-off and landing aerial vehicle, in the presence of disturbance due to wind, is presented. To this end, the backstepping procedure together with nested saturation function method is used. Firstly, a convenient change of coordinates in the aerial vehicle model is carried out to dissociate the rotational dynamics from the translational one. Secondly, the backstepping procedure is applied to obtain the height position controller, allowing the reduction of the system and expressing it as an integrator chain with nonlinear disturbance. Therefore, the nested saturation function method is used to obtain a stabilizing controller for the horizontal position and roll angle. The corresponding stability analysis is conducted via the Lyapunov second method. In addition, to estimate the disturbance due to wind, an extended state observer is used. The effectiveness of the proposed control scheme is assessed through numerical simulations, from which convincing results have been obtained.",
        "observaciones": "DOI 10.1155/2020/3510396",
        "lugar": "London",
        "pais": "Reino Unido",
        "noPaginas": "Article number 3510396",
        "volumen": "v. 2020",
        "inicio": "2020-09-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 38,
        "autores": [ "Juan Carlos Chimal Eguía"] ,
        "titulo": "Comparative performance analysis of a Brownian Carnot cycle from the perspective of a stochastic model against the Linear Irreversible Thermodynamics theory",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Physica A: Statistical Mechanics and its Applications"  ,
        "resumen": "In this paper we present a Brownian Carnot cycle, which has already been studied by Schmield et al. (2007) as well as by Izumida and Okuda (2010); but now considering two different working regimes, namely the Maximum Ecological Function (MEC) and the Maximum Efficient Power (MEP). For the MEC and MEP working regimes, the thermodynamic properties of the cycle are obtained, in particular, it is showed that the maximum efficiency now depends on two parameters α and β, instead of only one parameter obtained previously by Schmiled et al. in the maximum power regime. It is worthwhile to notice that for characteristic values of α and β the original results obtained by Schmield are recovered.",
        "observaciones": "DOI 10.1016/j.physa.2021.125743",
        "lugar": "Amsterdam",
        "pais": "Paises Bajos",
        "noPaginas": "Article number 125743",
        "volumen": "v. 570",
        "inicio": "2021-05-15",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 39,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "An Algebraic Fuzzy Pole Placement Approach to Stabilize Nonlinear Mechanical Systems",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "IEEE Transactions on Fuzzy Systems"  ,
        "resumen": "Based on the general structure of mechanical systems described by their state-space representation, the Takagi-Sugeno fuzzy modeling, and the controllability property of fuzzy systems, an algebraic and practical approach to computing the fuzzy gain capable of ensuring the stability property of the Takagi-Sugeno fuzzy model is proposed in this article. The main idea consists of finding a continuous fuzzy gain such that any linear behavior, defined by the adequate selection of eigenvalues, is induced in the closed-loop fuzzy system. Therefore, by continuity, if the fuzzy model is an approximation sufficiently close to the mechanical system, then such a nonlinear system is also stabilized by the fuzzy controller. A notable advantage of the proposed method, when compared with similar approaches, is the simplicity of the resulting gain. The validity of the approach is illustrated through the numerical simulation of a sufficiently complex nonlinear system. © 2022 IEEE.",
        "observaciones": "DOI 10.1109/TFUZZ.2021.3113560",
        "lugar": "New Jersey",
        "pais": "Estados Unidos",
        "noPaginas": "3322-3332",
        "volumen": "v. 30 no. 8",
        "inicio": "2022-08-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 40,
        "autores": [ "Corona Bermúdez Erendira","Juan Carlos Chimal Eguía","Corona Bermudez Uriel","Rivero Ángeles Mario Eduardo"] ,
        "titulo": "Chaos Meets Cryptography: Developing an S-Box Design with the Rössler Attractor",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Mathematics"  ,
        "resumen": "The volume of data transmitted over networks has significantly increased in recent years. For that reason, safeguarding the privacy, authenticity, and confidentiality of specific data is imperative, necessitating a type of encryption; symmetric encryption, known for its computational efficiency, is ideal for securing extensive datasets. A principal component within symmetric key algorithms is the substitution box (S-box), which creates confusion between plaintext and ciphertext, enhancing the security of the process. This paper proposes a fashion method to create chaotic S-boxes using the Rössler attractor as a chaotic process and the Rijndael S-box as a permutation box. The proposed S-boxes are evaluated with bijectivity, non-linearity (NL), strict avalanche criterion (SAC), bit independence criterion (BIC), linear approximation probability (LAP), and differential uniformity (DU). The analyses show that the proposed method helps generate a high-resistance S-box to well-known attacks and high efficiency, executing in short computational time. © 2023 by the authors.",
        "observaciones": "DOI 10.3390/math11224575",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 4575",
        "volumen": "v. 11 no. 22",
        "inicio": "2023-11-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 41,
        "autores": [ "Rodríguez Gómez Ariadna Isabel","Rivero Ángeles Mario Eduardo","Orea Flores Izlian Yolanda","Gallegos García Gina","Juan Carlos Chimal Eguía"] ,
        "titulo": "Performance Analysis of CSMA/NP under Finite Population Environments",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Sensors"  ,
        "resumen": "In this study, we analyze the CSMA Non-Persistent protocol with a finite number of nodes, providing more accurate results for applications like wireless sensor networks. The finite model addresses scenarios where the node count is moderate, capturing realistic system dynamics. Our analysis reveals a dependency on the node count, impacting system throughput. As the node count increases, throughput behavior aligns with Kleinrock’s infinite model. We derive a complex closed-form throughput expression for a finite quantity of nodes in the system, solved numerically, and offer an approximate expression for specific conditions. These insights advance understanding of low-contention network performance, especially in scenarios where the infinite model becomes inadequate. © 2024 by the authors.",
        "observaciones": "DOI 10.3390/s24113290",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 3290",
        "volumen": "v. 24 no. 11",
        "inicio": "2024-06-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 42,
        "autores": [ "Carlos Fernando Aguilar Ibáñez","Suárez Castañón Miguel Santiago","Gutiérrez Frías Oscar Octavio","Martínez Castro Jesús Alberto"] ,
        "titulo": "A Simple Approach to Regulate a PVTOL System Using Matching Conditions",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Journal of Intelligent & Robotic Systems"  ,
        "resumen": "In this work, based on shaping an energy function, it is introduced an output-feedback regulation control law for a Planar Vertical Takeoff and Landing (PVTOL) aircraft. To this end, a version of the matching control energy method is used to construct the Lyapunov candidate function and the stabilizer controller to regulate the PVTOL aircraft. The non-measurable system velocities are recovered using a suitable exact differentiator observer, achieved through super-twisting based observer. The theorem of LaSalle, together with some tools from the cascade system theory, was used to carry out the closed-loop stability analysis. Using a suitable finite time-varying identificator, the obtained controllers were improved to compensate bounded, smooth, and matching perturbations. Numerical simulations were included to test the effectiveness of the obtained controller. ",
        "observaciones": "DOI 10.1007/s10846-019-01087-x",
        "lugar": "Dordrecht",
        "pais": "Paises Bajos",
        "noPaginas": "511-524",
        "volumen": "v, 98 no. 2",
        "inicio": "2020-05-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 43,
        "autores": [ "Carlos Fernando Aguilar Ibáñez","Suárez Castañón Miguel Santiago"] ,
        "titulo": "A Trajectory Planning Based Controller to Regulate an Uncertain 3D Overhead Crane System",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "International Journal of Applied Mathematics and Computer Science"  ,
        "resumen": "We introduce a control strategy to solve the regulation control problem, from the perspective of trajectory planning, for an uncertain 3D overhead crane. The proposed solution was developed based on an adaptive control approach that takes advantage of the passivity properties found in this kind of systems. We use a trajectory planning approach to preserve the accelerations and velocities inside of realistic ranges, to maintaining the payload movements as close as possible to the origin. To this end, we carefully chose a suitable S-curve based on the Bezier spline, which allows us to efficiently handle the load translation problem, considerably reducing the load oscillations. To perform the convergence analysis, we applied the traditional Lyapunov theory, together with Barbalat's lemma. We assess the effectiveness of our control strategy with convincing numerical simulations.",
        "observaciones": "DOI 10.2478/amcs-2019-0051",
        "lugar": "Zielona Gora",
        "pais": "Polonia",
        "noPaginas": "693-702",
        "volumen": "v. 29 no. 4",
        "inicio": "2020-12-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 44,
        "autores": [ "Juan Carlos Chimal Eguía"] ,
        "titulo": "QoSComm: A Data Flow Allocation Strategy among SDN-Based Data Centers for IoT Big Data Analytics",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Applied Sciences-Basel"  ,
        "resumen": "When Internet of Things (IoT) big data analytics (BDA) require to transfer data streams among software defined network (SDN)-based distributed data centers, the data flow forwarding in the communication network is typically done by an SDN controller using a traditional shortest path algorithm or just considering bandwidth requirements by the applications. In BDA, this scheme could affect their performance resulting in a longer job completion time because additional metrics were not considered, such as end-to-end delay, jitter, and packet loss rate in the data transfer path. These metrics are quality of service (QoS) parameters in the communication network. This research proposes a solution called QoSComm, an SDN strategy to allocate QoS-based data flows for BDA running across distributed data centers to minimize their job completion time. QoSComm operates in two phases: (i) based on the current communication network conditions, it calculates the feasible paths for each data center using a multi-objective optimization method; (ii) it distributes the resultant paths among data centers configuring their openflow Switches (OFS) dynamically. Simulation results show that QoSComm can improve BDA job completion time by an average of 18%.",
        "observaciones": "DOI 10.3390/app10217586",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 7586",
        "volumen": "v. 10 no. 21",
        "inicio": "2020-11-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 45,
        "autores": [ "Juan Carlos Chimal Eguía"] ,
        "titulo": "El ciclo Zilch en el contexto de la termodinámica de tiempos finitos: Eficiencia y potencia de salida",
        "tipo": "Revista",
        "subTipo": "Tipo C",
        "descripcion": "Información Tecnologica"  ,
        "resumen": "The primary objective of the present study is to examine the Zilch cycle from a finite-time thermodynamics perspective. A modification of the original cycle is proposed by explicitly including the difference between working temperatures and heat source temperatures. Expressions of power output and cycle efficiency are constructed with neutral variables defined as ratios between working and temperature sources. To simplify the obtained expressions for power and efficiency, appropriate restrictions are imposed to find physical existence regions. The results show the viability of the procedures used and show that the cycle studied can serves as a theoretical model for heat regeneration plants. It is concluded that it is possible to successfully describe the behavior of regeneration plants by describing power and efficiency dynamics.",
        "observaciones": "DOI 10.4067/S0718-07642021000200003",
        "lugar": "La Serena",
        "pais": "Chile",
        "noPaginas": "3-10",
        "volumen": "v. 32 no. 2",
        "inicio": "2021-04-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 46,
        "autores": [ "Carlos Fernando Aguilar Ibáñez","Cruz Cortés Nareli"] ,
        "titulo": "A Parallel Strategy for Solving Sparse Linear Systems over Finite Fields",
        "tipo": "Revista",
        "subTipo": "CONACYT",
        "descripcion": "Computación y Sistemas"  ,
        "resumen": "In this paper we describe a number of parallel techniques that were applied to the problem of finding the null-spaces of thousands of large sparse matrices. This collection of matrices were derived from the discrete logarithm problem attack over the finite field F36_509 recently carried out by Adj et al. in [2]. Our software library was mainly executed in the supercomputer ABACUS [7], where in total 21, 870 large sparse linear algebra systems were processed. Solving those linear algebra problems involved a computational effort of over 138 core-years, requiring a memory space of over 645 gigabytes to store the corresponding vector solutions. © 2022 Instituto Politecnico Nacional. All rights reserved.",
        "observaciones": "DOI 10.13053/CyS-26-1-3494",
        "lugar": "Ciudad de México",
        "pais": "Mexico",
        "noPaginas": "493-504",
        "volumen": "v. 26 no. 1",
        "inicio": "2022-01-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 47,
        "autores": [ "Juan Carlos Chimal Eguía"] ,
        "titulo": "Linear Irreversible Thermodynamics: A Glance at Thermoelectricity and the Biological Scaling Laws",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Entropy"  ,
        "resumen": "This paper presents so-called thermoelectric generators (TEGs), which are considered thermal engines that transform heat into electricity using the Seebeck effect for this purpose. By using linear irreversible thermodynamics (LIT), it is possible to study the thermodynamic properties of TEGs for three different operating regimes: maximum power output (MPO), maximum ecological function (MEF) and maximum power efficiency (MPE). Then, by considering thermoelectricty, using the correspondence between the heat capacity of a solid and the metabolic rate, and taking the generation of energy by means of the metabolism of an organism as a process out of equilibrium, it is plausible to use linear irreversible thermodynamics (LIT) to obtain some interesting results in order to understand how metabolism is generated by a particle's released energy, which explains the empirically studied allometric laws. © 2023 by the authors.",
        "observaciones": "DOI 10.3390/e25121575",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 1575",
        "volumen": "v. 25, no. 12",
        "inicio": "2023-12-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 48,
        "autores": [ "Hernández Oregón Gerardo","Rivero Ángeles Mario Eduardo","Juan Carlos Chimal Eguía","Coyac Torres Jorge Enrique"] ,
        "titulo": "Performance Analysis in Peer-to-Peer Networks with Collaborative Initial States",
        "tipo": "Revista",
        "subTipo": "CONACYT",
        "descripcion": "Computación y Sistemas"  ,
        "resumen": "Currently, the trends of the new generations of telecommunications (6G and beyond) point towards a non-centralized process, however, for these architectures where no central entity regulates the transmission and information sharing, collaboration among nodes becomes a major issue to provide an adequate service. To this end, in this paper, we study Peer-to-Peer (P2P) systems to obtain models that reproduce these technologies’ operation and the collaboration mechanism. The behavior of these systems is modeled through a Continuous Time Markov Chain (CTMC), and later we develop a Discrete Event Simulation (DES) to validate the analytical results. For solving these processes, M/M/s type queues were used in order to analyze the impact of collaboration levels on the system performance. © 2024 Instituto Politecnico Nacional. All rights reserved",
        "observaciones": "DOI 10.13053/CyS-28-2-4721",
        "lugar": "Ciudad de México",
        "pais": "Mexico",
        "noPaginas": "341-352",
        "volumen": "v. 28 no. 2",
        "inicio": "2024-04-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 49,
        "autores": [ "Carlos Fernando Aguilar Ibáñez","Suárez Castañón Miguel Santiago","Gutiérrez Frías Oscar Octavio","Rubio Ávila José de Jesús"] ,
        "titulo": "A Robust Control Strategy for Landing an Unmanned Aerial Vehicle on a Vertically Moving Platform",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Complexity"  ,
        "resumen": "In this work, we solve the uncertain unmanned aerial vehicle smooth landing problem over a moving platform, assuming that the aircraft position relative to the platform and its acceleration is always measurable. The landing task is carried out by an output-feedback robust controller, together with a repulsive force. The robust controller controls the nominal model, accomplishes the needed tracking trajectory, and counteracts the unknown uncertainties. To assure that the aircraft is always above the platform, we include a repulsive force that only works in a small vicinity of the platform. To estimate the relative aircraft velocity and platform acceleration, we use a supertwisting-based observer, assuring finite-time convergence of these signals. This fact allowed us to design the feedback state stabilizer independently of the observer design (in accordance with the separation principle). We confirmed the effectiveness of our control approach by convincing numerical simulations.",
        "observaciones": "DOI 10.1155/2020/2917684",
        "lugar": "London",
        "pais": "Estados Unidos",
        "noPaginas": "Article number 2917684",
        "volumen": "2020",
        "inicio": "2020-07-15",
        "fin": "",
        "ISBN": ""
    }
    ,
    {
        "id": 50,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "PI-Type Controllers and &#x03A3;- Modulation for Saturated DC-DC Buck Power Converters",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "IEEE Access"  ,
        "resumen": "Departing from analyzing a general input-saturated second-order system, a Lyapunov-based constructive procedure for the output-feedback stabilization of the constantly perturbed DC-DC buck power converter is presented. The proposed scheme also incorporates a &#x03A3;-&#x0394; modulator. The obtained control scheme is developed in two parts: a proportional-integral-type family of algorithms devoted to regulating the uncertain system by using measurements of the output voltage and a &#x03A3;-&#x0394; modulator dedicated to transforming the control action into a &#x007B;0, 1&#x007D; discrete-valued signal. This modulator is a kind of a sliding controller, which can be seen as a subsystem with an on-off output. This combination, the PI&#x2013;type family of controllers and the &#x03A3;-&#x0394; modulator, assures the global stability of the closed-loop system, even if parametric uncertainties are presented. The convergence analysis was carried out using Lyapunov&#x2019;s method. The theoretical results are confirmed using real&#x2013;time experimental tests, which demonstrate the anti-windup scheme and the &#x03A3;-&#x0394; modulator efficiency. The experiments consider the saturation of the control input and disturbances, having obtained convincing results. CCBY",
        "observaciones": "DOI 10.1109/ACCESS.2021.3054600",
        "lugar": "New Jersey",
        "pais": "Estados Unidos",
        "noPaginas": "20346-20357",
        "volumen": "9",
        "inicio": "2021-01-25",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 51,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Finite-Time Stability of a Second-Order Bang-Bang Sliding Control Type",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "Mathematics"  ,
        "resumen": "This paper presents the double chain-integrator finite-time convergence in a closed loop with a second-order bang-bang sliding control. The direct Lyapunov method carried out the stability analysis and the reaching time estimation using a suitable non-smooth strong Lyapunov function. That is, the proposed energy function is strictly positive definite, with a strictly definite negative time derivative. Additionally, the proposed function estimates the reaching time in the presence of matching bounded perturbations. Numerical comparisons with well-known approaches were performed to assess the proposed strategy's effectiveness. © 2022 by the authors.",
        "observaciones": "DOI 10.3390/math10213937",
        "lugar": "Basel",
        "pais": "Suiza",
        "noPaginas": "Article number 3937",
        "volumen": "v. 10 no. 21",
        "inicio": "2022-11-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 52,
        "autores": [ "Carlos Fernando Aguilar Ibáñez","Barrón Fernández Ricardo"] ,
        "titulo": "Model-Free Control to Maneuver an Uncertain 2-DOF Manipulator Robot",
        "tipo": "Congreso",
        "subTipo": "Memoria",
        "descripcion": "3rd Latin American Congress on Automation and Robotics"  ,
        "resumen": "A model-free control approach-based solution for the trajectory tracking control problem of an uncertain flat system is presented. The solution was accomplished by solving a nonlinear uncertain second-order flat system. The unknown matching dynamics are identified through a conveniently proposed algebraic estimator or iterated integrator. The non-available states were obtained by applying a high-gain observer. The stability analysis of the closed-loop system, together with the high-gain observer, was accomplished through the Lyapunov method. The effectiveness of the proposed controller was evaluated in a partially known 2-DOF manipulator, having obtained satisfactory results.",
        "observaciones": "DOI 10.1007/978-3-030-90033-5_6 Lecture Notes in Networks and Systems",
        "lugar": "Monterrey",
        "pais": "Mexico",
        "noPaginas": "43-53",
        "volumen": "LNNS 347",
        "inicio": "2021-11-17",
        "fin": "2021-11-19",
        "ISBN": "9783030900328"
    },
    {
        "id": 53,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "A Robust Trajectory Tracking Problem Solution for a PVTOL System under Crosswind",
        "tipo": "Congreso",
        "subTipo": "Memoria",
        "descripcion": "2024 21st International Conference on Electrical Engineering, Computing Science and Automatic Control, CCE 2024"  ,
        "resumen": "This paper proposes a solution to the trajectory tracking problem of a Planar Vertical Takeoff and Landing (PVTOL) aircraft disturbed by crosswind. The proposed approach combines a sliding mode control of integral type to accomplish the trajectory tracking problem and a discontinuous controller to counteract the effect of the disturbance online. A numerical simulation was carried out to assess the performance of the proposed approach, with satisfactory results. © 2024 IEEE.",
        "observaciones": "DOI 10.1109/CCE62852.2024.10770957",
        "lugar": "Ciudad de México",
        "pais": "Mexico",
        "noPaginas": "",
        "volumen": "",
        "inicio": "2024-10-23",
        "fin": "2024-10-25",
        "ISBN": ""
    },
    {
        "id": 54,
        "autores": [ "Juan Carlos Chimal Eguía"] ,
        "titulo": "Optimization of an Agrawal Heat Engine by Means of the Saving Functions",
        "tipo": "Congreso",
        "subTipo": "Memoria",
        "descripcion": "37th International Conference on Efficiency, Cost, Optimization, Simulation and Environmental Impact of Energy Systems, ECOS 2024"  ,
        "resumen": "Finite Time Thermodynamics (TTF) (Andresen B., Salamon P. and Berry R. S., 1997) is a branch of Thermodynamics that is dedicated to obtaining theoretical models of the operation of power plants, operating limits on thermodynamic variables such as: efficiency, power and entropy production among other thermodynamic variables. One method to improve the design of such power plants through TTF is to propose objective functions applied to different thermal engines, such as the Curzon-Ahlborn (CA) heat engine (1975). Velasco et al (2000) presented a new objective function in terms of a cost-effective type process applied to a CA heat engine. The objective function defined as a savings function, which allows a reduction of unwanted secondary effects in the operation of the power plant. Agrawal (2009) proposed a simplified version of the CA heat engine, in which he assigns the same thermal resistance and the same temperature difference to the upper and lower isotherms of the Carnot cycle. In the engine model proposed by Agrawal, the efficiency at maximum power coincides with efficiencies values reported for real engines, but with a slightly lower power production. In 2021, Barranco-Jiménez et al (2021) made use of the so-called saving functions to analyze the Novikov (1958) heat engine model by varying the degree of participation of the processes proposed by Velasco et al (2000), in addition to considering two different heat transfer laws. In this work we propose the use of savings functions following the approach used by Velasco but applied to the Agrawal engine, through a Newton-type heat transfer law between the energy reservoirs. In addition, an analysis is presented on the variation of the weight coefficients such as that carried out by Barranco-Jiménez et al (2021) to finally present a numerical comparison with the reported efficiency of some real power plants. © 2024 37th International Conference on Efficiency, Cost, Optimization, Simulation and Environmental Impact of Energy Systems, ECOS 2024. All rights reserved.",
        "observaciones": "DOI 10.52202/077185-0170",
        "lugar": "Rodas",
        "pais": "Grecia",
        "noPaginas": "1984-1993",
        "volumen": "",
        "inicio": "2024-06-30",
        "fin": "2024-07-05",
        "ISBN": "9798331307660"
    }
    ,
    {
        "id": 55,
        "autores": [ "Cardona López Manuel Alejandro","Juan Carlos Chimal Eguía"] ,
        "titulo": "A Complementary Algorithm for Image Cryptosystems to Enhance Entropy",
        "tipo": "Congreso",
        "subTipo": "Memoria",
        "descripcion": "9th International Conference on Mobile and Secure Services, MOBISECSERV 2024"  ,
        "resumen": "Each new image cryptosystem aims to achieve improved security results, with entropy being one of the primary measures for quantifying its security. For 8-bit images, the ideal entropy value is 8.0. However, various encryption algorithms typically get values close to this ideal, such as 7.999, but not exactly 8.0. To address this, we propose a complementary algorithm designed to increase the entropy achieved by cryptosystems. This algorithm adds new pixel rows to the encrypted images to achieve a uniform histogram and consequently obtain an entropy value of 8.0. The pixels in these additional rows are assigned the missing intensity values to fit a uniform distribution. To test the proposal, it was applied to four images initially encrypted using the AES-CBC cryptosystem, increasing the entropy from 7.9992 to 8.0 and achieving the highest level of security according to this measure. Although this approach involves a 10% increase in the total number of pixels, it is more efficient compared to other methods that achieve lower entropy values with a larger increase in image size. Finally, this algorithm is compatible with any image cryptosystem for uncompressed images, enhancing their entropy and security. © 2024 IEEE.",
        "observaciones": "DOI 10.1109/MobiSecServ63327.2024.10760051",
        "lugar": "Miami",
        "pais": "Mexico",
        "noPaginas": "",
        "volumen": "",
        "inicio": "2024-06-09",
        "fin": "2024-07-10",
        "ISBN": "9798350390896"
    },
    {
        "id": 56,
        "autores": [ "Cardona López Manuel Alejandro","Juan Carlos Chimal Eguía"] ,
        "titulo": "Key Exchange with Diffie-Hellman Protocol and Composite Hash-Functions",
        "tipo": "Congreso",
        "subTipo": "Memoria",
        "descripcion": "12th International Symposium on Digital Forensics and Security, ISDFS 2024"  ,
        "resumen": "For the secure transmission of symmetrically encrypted data, sharing not only the data but also its secret key is crucial. Therefore, an effective key exchange mechanism is essential for secure key transmission. The Diffie-Hellman key exchange protocol has traditionally served as a method for securely transmitting secret keys by generating session keys. It relays its security on the discrete logarithm problem and can be enhanced by combining it with other cryptographic tools. In this context, we propose a key exchange algorithm that incorporates composite Hash-functions. The shared key of the Diffie-Hellman protocol is used to construct 128 strings, each processed individually by a distinct composite SHA-512 function a secret number of times. Each number represents a byte of the key intended for transmission. Consequently, the encrypted key is formed by concatenating 128 strings of 512 bits each. The results of the encrypted key show entropy values close to 7.9, even when the secret key exhibits numerical patterns. The proposed algorithm utilizes 1024-bit numbers for the secret key, prime, and generator. It does not require sharing additional parameters beyond the public parameters of Diffie-Hellman and the encrypted key. Additionally, for enhanced security, private values can be changed in every communication, albeit at the cost of increased time, approximately 10 ms. © 2024 IEEE.",
        "observaciones": "DOI 10.1109/ISDFS60797.2024.10527265",
        "lugar": "San Antonio, Texas",
        "pais": "Estados Unidos",
        "noPaginas": "",
        "volumen": "",
        "inicio": "2024-04-29",
        "fin": "2024-04-30",
        "ISBN": "9798350330366"
    },
    {
        "id": 57,
        "autores": [ "Cardona López Manuel Alejandro","Juan Carlos Chimal Eguía"] ,
        "titulo": "The Substitution-Boxes Incompatibility in JPEG Image Encryption",
        "tipo": "Congreso",
        "subTipo": "Memoria",
        "descripcion": "6th IEEE Conference on Dependable and Secure Computing, DSC 2023"  ,
        "resumen": "JPEG encryption with the Encrypion-Then-Compression (EtC) scheme allows for encrypted images to be still considered as images and not only as encrypted data. This makes them compatible with social media and cloud platform requirements. On the other hand, substitution boxes are a traditional encryption tool in modern image cryptosystems because of their benefits to enhance security. However, EtC does not include them for keeping image format compatibility. This argument is only mentioned and not explained in regular papers. Therefore, the purpose of this paper is to explore the results that lead to this incompatibility. Although a plain image has differences in the pixel values after JPEG lossy compression, they are not perceived by the human visual system. However, the substitution boxes generate superior pixel-value differences that are perceptible. This paper shows the aforementioned using the AES S-Box. The numerical change effect in pixels from substitution to lossy compression execution is analyzed. The simulations show that the procedure falls on the fact that the decrypted JPEG image is not a sufficient approximation to recognize the original. Finally, the differences between the encrypted and plain images to support JPEG lossy compression are reported. © 2023 IEEE.",
        "observaciones": "DOI 10.1109/DSC61021.2023.10354118",
        "lugar": "Tampa, Florida",
        "pais": "Estados Unidos",
        "noPaginas": "",
        "volumen": "",
        "inicio": "2023-11-07",
        "fin": "2023-11-09",
        "ISBN": "9798350382112"
    },
    {
        "id": 58,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "Drones to Go: A Crash Course for Scientists and Makers",
        "tipo": "Libro",
        "subTipo": "Indefinido",
        "descripcion": ""  ,
        "resumen": "",
        "observaciones": "DOI 10.1007/978-1-4842-6788-2",
        "lugar": "New York",
        "pais": "Estados Unidos",
        "noPaginas": "348 p.",
        "volumen": "",
        "inicio": "2021-01-01",
        "fin": "",
        "ISBN": ""
    },
    {
        "id": 59,
        "autores": [ "Carlos Fernando Aguilar Ibáñez"] ,
        "titulo": "A robust trajectory tracking controller for a magnetic system: A sliding mode-based approach",
        "tipo": "Revista",
        "subTipo": "JCR",
        "descripcion": "European Journal of Control"  ,
        "resumen": "A robust control strategy is developed to address the position trajectory tracking problem in a perturbed magnetic levitation system. The system consists of two electromagnets, each controlled by its respective voltage. To enhance the model's complexity, perturbations are introduced into the electrical and mechanical subsystems. The controller design begins under the assumption of a disturbance-free system. Subsequently, an integral sliding mode controller (ISMC) is incorporated to compensate for matching disturbances initially excluded from the model, and a super-twisting observer (STO) is employed to estimate and reject disturbances affecting the mechanical dynamics. The proposed control strategy enforces the convergence of two invariant manifolds to the origin. The first manifold ensures the asymptotic convergence of the position-tracking error to zero, while the second stabilizes the magnetic system and prevents magnetic flux saturation singularities. The stability properties of the closed-loop system are rigorously analyzed using Lyapunov-based methods, ensuring robustness against bounded disturbances. Numerical simulations are conducted to evaluate the performance of the control scheme, demonstrating its efficacy in achieving precise trajectory tracking disturbance rejection under the imposed perturbations.",
        "observaciones": "10.1016/j.ejcon.2025.101189",
        "lugar": "Amsterdam",
        "pais": "Paises Bajos",
        "noPaginas": "Article number 101189",
        "volumen": "82",
        "inicio": "2025-03-01",
        "fin": "",
        "ISBN": ""
    }


]